viscoelastic/viscoelasticFluidFoam/lidDrivenCavity/16M_fixedTol/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
    grad(p)             Gauss linear;
    grad(U)             Gauss linear;
}

divSchemes
{
    default             Gauss upwind;
    div(phi,U)          Gauss upwind;
    div(phi,tauM1)      Gauss upwind;
    div(phi,tauM2)      Gauss upwind;
    div(phi,tauM3)      Gauss upwind;
    div(phi,tauM4)      Gauss upwind;
    div(phi,tauM5)      Gauss upwind;
    div(phi,tauM6)      Gauss upwind;
    div(tau)            Gauss linear;
}

laplacianSchemes
{
    default                      none;
    laplacian(etaPEff,U)         Gauss linear corrected;
    laplacian(etaPEff+etaS,U)    Gauss linear corrected;
    laplacian((1|A(U)),p)        Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
    interpolate(HbyA)   linear;
}

snGradSchemes
{
    default             corrected;
}

// ************************************************************************* //
